<template>
  <div class="tip">
    <!-- 常见科室 -->
    <ContentCard
      title="常见科室"
      :moreText="moreText"
      @moreClick="onDepartmentMoreClick"
    >
      <template #icon>
        <svg
          t="1761803058902"
          class="icon"
          viewBox="0 0 1024 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="10997"
          width="16"
          height="16"
        >
          <path
            d="M819.7 235.1h-61.5c-17 0-30.8 13.8-30.8 30.8s13.8 30.8 30.8 30.8h61.5c17 0 30.8 13.8 30.8 30.8v153.8h-92.3c-17 0-30.8 13.8-30.8 30.8s13.8 30.8 30.8 30.8h92.3v276.9c0 17-13.8 30.8-30.8 30.8H204.3c-17 0-30.8-13.8-30.8-30.8v-277h92.3c17 0 30.8-13.8 30.8-30.8s-13.8-30.8-30.8-30.8h-92.3V327.4c0-17 13.8-30.8 30.8-30.8h430.8c17 0 30.8-13.8 30.8-30.8v-92.3c0-34-27.6-61.5-61.5-61.5H419.7c-34 0-61.5 27.6-61.5 61.5V235H204.3c-51 0-92.3 41.3-92.3 92.3v492.3c0 51 41.3 92.3 92.3 92.3h615.4c51 0 92.3-41.3 92.3-92.3V327.4c0-51-41.3-92.3-92.3-92.3z m-400-61.6h184.6V235H419.7v-61.5z"
            fill="#605D5A"
            p-id="10998"
          ></path>
          <path
            d="M635.1 481.2h-30.8v-30.8c0-34-27.6-61.5-61.5-61.5h-61.5c-34 0-61.5 27.6-61.5 61.5v30.8H389c-34 0-61.5 27.6-61.5 61.5v61.5c0 34 27.6 61.5 61.5 61.5h30.8v30.8c0 34 27.6 61.5 61.5 61.5h61.5c34 0 61.5-27.6 61.5-61.5v-30.8h30.8c34 0 61.5-27.6 61.5-61.5v-61.5c0-33.9-27.5-61.5-61.5-61.5z m0 123.1h-92.3v92.3h-61.5v-92.3H389v-61.5h92.3v-92.3h61.5v92.3h92.3v61.5z"
            fill="#FF6B00"
            p-id="10999"
          ></path>
        </svg>
      </template>
      <template #content>
        <Content :items="departmentItems" flex-layout />
      </template>
    </ContentCard>

    <!-- 平台公告 -->
    <ContentCard
      title="平台公告"
      class="notice-card"
      :moreText="moreText"
      @moreClick="onNoticeMoreClick"
    >
      <template #icon>
        <svg
          t="1761802943117"
          class="icon"
          viewBox="0 0 1024 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="7865"
          width="16"
          height="16"
        >
          <path
            d="M342 391.1h24.7v180.4H342z"
            fill="#FFFFFF"
            p-id="7866"
          ></path>
          <path
            d="M404.6 711.5c-0.4 3.7-0.6 7.5-0.6 11.2v70c0 59.7 48.4 108 108 108 59.7 0 108-48.4 108-108v-70c0-3.8-0.2-7.5-0.6-11.2H404.6z m0 0"
            fill="#CCE5F6"
            p-id="7867"
          ></path>
          <path
            d="M512 923.9c-72.3 0-131.1-58.8-131.1-131.1v-70c0-4.5 0.2-9.1 0.7-13.6 1.2-11.8 11.1-20.7 23-20.7h214.9c11.8 0 21.8 8.9 23 20.7 0.5 4.5 0.7 9.1 0.7 13.6v70c-0.1 72.3-58.9 131.1-131.2 131.1z m-84.9-189.3v58.1c0 46.8 38.1 84.9 84.9 84.9 46.8 0 84.9-38.1 84.9-84.9v-58.1H427.1z m148-477.2c-0.8 0-1.6 0-2.4-0.1-12.7-1.3-21.9-12.7-20.6-25.4 0.1-1.4 0.2-2.8 0.2-4.2v-41.1c0-22.2-18.1-40.3-40.3-40.3-22.2 0-40.3 18.1-40.3 40.3v41.1c0 1.4 0.1 2.8 0.2 4.2 1.3 12.7-7.9 24.1-20.6 25.4-12.7 1.3-24.1-7.9-25.4-20.6-0.3-3-0.5-6-0.5-9v-41.1c0-47.7 38.8-86.5 86.5-86.5s86.5 38.8 86.5 86.5v41.1c0 3-0.2 6-0.5 9-1.1 11.9-11.1 20.7-22.8 20.7z m0 0"
            fill="#2197EF"
            p-id="7868"
          ></path>
          <path
            d="M756.7 616.9c-12.8 0-23.1-10.3-23.1-23.1V481.3c0-122.2-99.4-221.6-221.6-221.6-122.2 0-221.6 99.4-221.6 221.6v112.5c0 12.8-10.3 23.1-23.1 23.1s-23.1-10.3-23.1-23.1V481.3c0-147.7 120.2-267.8 267.8-267.8 147.7 0 267.9 120.2 267.9 267.8v112.5c0 12.8-10.4 23.1-23.2 23.1z m0 0"
            fill="#2197EF"
            p-id="7869"
          ></path>
          <path
            d="M168.3 677h687.5v113.6H168.3z"
            fill="#CCE5F6"
            p-id="7870"
          ></path>
          <path
            d="M855.7 813.7H168.3c-12.8 0-23.1-10.3-23.1-23.1V677c0-12.8 10.3-23.1 23.1-23.1h687.5c12.8 0 23.1 10.4 23.1 23.1v113.6c0 12.8-10.4 23.1-23.2 23.1z m-664.3-46.2h641.3v-67.4H191.4v67.4z m0 0"
            fill="#2197EF"
            p-id="7871"
          ></path>
        </svg>
      </template>
      <template #content>
        <Content :items="noticeItems" ellipsis />
      </template>
    </ContentCard>

    <!-- 停诊公告 -->
    <ContentCard
      title="停诊公告"
      class="notice-card"
      :moreText="moreText"
      @moreClick="onStopNoticeMoreClick"
    >
      <template #icon>
        <svg
          t="1685154393740"
          class="icon"
          viewBox="0 0 1024 1024"
          version="1.1"
          xmlns="http://www.w3.org/2000/svg"
          p-id="6081"
          width="16"
          height="16"
        >
          <path
            d="M736 768h-448a32 32 0 0 1 0-64h448a32 32 0 0 1 0 64z m-44.8-415.552l-147.669333-147.669333a61.994667 61.994667 0 0 1-62.848 0l-147.669334 147.669333a32.554667 32.554667 0 0 1-46.037333-46.037333l161.578667-161.578667a63.68 63.68 0 0 1 127.104 0l161.578666 161.578667a32.554667 32.554667 0 0 1-46.037333 46.037333zM565.333333 512a32 32 0 0 1 0 64h-277.333333a32 32 0 0 1 0-64h277.333333z"
            fill="#EB9E52"
            p-id="6082"
          ></path>
          <path
            d="M853.333333 981.333333H170.666667a85.333333 85.333333 0 0 1-85.333334-85.333333V384a85.333333 85.333333 0 0 1 85.333334-85.333333h682.666666a85.333333 85.333333 0 0 1 85.333334 85.333333v512a85.333333 85.333333 0 0 1-85.333334 85.333333z m21.333334-576a42.666667 42.666667 0 0 0-42.666667-42.666666H192a42.666667 42.666667 0 0 0-42.666667 42.666666v469.333334a42.666667 42.666667 0 0 0 42.666667 42.666666h640a42.666667 42.666667 0 0 0 42.666667-42.666666V405.333333z"
            fill="#5C8EF3"
            p-id="6083"
          ></path>
        </svg>
      </template>
      <template #content>
        <Content :items="stopNoticeItems" ellipsis />
      </template>
    </ContentCard>
  </div>
</template>

<script lang="ts" setup>
  import { ref } from "vue";
  import Content from "./components/content.vue";
  import ContentCard from "./components/contentCard.vue";

  const moreText = ref("更多");
  // 常见科室数据
  const departmentItems = [
    "神经内科",
    "消化内科",
    "呼吸内科",
    "内科",
    "神经外科",
    "妇科",
    "产科",
    "儿科",
  ];

  // 平台公告数据
  const noticeItems = [
    "关于延长北京大学国际医院放假的通知",
    "北京中医药大学东方医院部分科室医生门诊医",
    "武警总医院号源暂停更新通知",
  ];

  // 停诊公告数据
  const stopNoticeItems = [
    "中国人民解放军总医院第六医学中心(原海军总医院)呼吸内科门诊停诊公告",
    "首都医科大学附属北京潞河医院老年医学科门诊停诊公告",
    "中日友好医院中西医结合心内科门诊停诊公告",
  ];

  // 事件处理函数
  const onDepartmentMoreClick = () => {
    console.log("常见科室更多按钮点击");
  };

  const onNoticeMoreClick = () => {
    console.log("平台公告更多按钮点击");
  };

  const onStopNoticeMoreClick = () => {
    console.log("停诊公告更多按钮点击");
  };
</script>
<style lang="scss" scoped>
  .tip {
    color: #7f7f7f;

    .notice-card {
      margin: 20px 0;
    }
  }
</style>
